# Напишите код, который выводит вопрос: «What do you call a bear with no teeth?»,
# а в следующей строке выводит ответ: «A gummy bear!» Попробуйте обойтись
# одной строкой кода.

print("What do you call a bear with no teeth?: \nA gummy bear!")
