# Выведите число «пи» (π) с точностью до
# 5 знаков.

import math
result = round(math.pi, 5)
print(result)
