# Вывести случайное число
# в диапазоне
# от 1 до 100
# включительно.

import random
print(random.randint(0, 100))
