# Предложите пользователю
# ввести его почтовый индекс.
# Выведите первые две буквы
# слова в верхнем регистре
# .

index = input("Please, enter your post index code: ")
print(f"The result is: {index[0:2].upper()}")
